leeebo/esp-eth-drivers/ethernet_init/examples/simple-ethernet/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ETHERNET_SPI_SUPPORT=y
CONFIG_ETHERNET_USE_CH390=y
CONFIG_ETHERNET_SPI_SCLK_GPIO=6
CONFIG_ETHERNET_SPI_MOSI_GPIO=8
CONFIG_ETHERNET_SPI_MISO_GPIO=7
CONFIG_ETHERNET_SPI_CLOCK_MHZ=25
CONFIG_ETHERNET_SPI_CS0_GPIO=5
CONFIG_ETHERNET_SPI_INT0_GPIO=1
